Revit 2024 API
BuiltInFailures.AutoRouteFailures.ZeroLengthSegmentWarning Property
 The solution is failing to do segments which are zero length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ZeroLengthSegmentWarning { get; }
Visual Basic
Public Shared ReadOnly Property ZeroLengthSegmentWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ZeroLengthSegmentWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace